Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.1.66/edc/PIC32MK0256GPH064.PIC
      <edc:SFRDef edc:_addr="0x1F800A10" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-02819_pfm_ctrl_32bit_upb_v2.Module" edc:_refcount="1" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="NVMKEY" edc:desc="" edc:grp="FLASH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NVMKEY" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="- - -" ltx:memberofperipheral="NVM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMKEY" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="NVMKEY" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800A20" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-02819_pfm_ctrl_32bit_upb_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMADDR" edc:desc="" edc:grp="NVM" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NVMADDR" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMADDR" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="NVMADDR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800A30" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-02819_pfm_ctrl_32bit_upb_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMDATA0" edc:desc="" edc:grp="FLASH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NVMDATA0" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMDATA0" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="NVMDATA0" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800A40" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-02819_pfm_ctrl_32bit_upb_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMDATA1" edc:desc="" edc:grp="FLASH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NVMDATA1" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMDATA1" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="NVMDATA1" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800A50" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-02819_pfm_ctrl_32bit_upb_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMDATA2" edc:desc="" edc:grp="FLASH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NVMDATA2" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMDATA2" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="NVMDATA2" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800A60" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-02819_pfm_ctrl_32bit_upb_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMDATA3" edc:desc="" edc:grp="FLASH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NVMDATA3" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMDATA3" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="NVMDATA3" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800A70" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-02819_pfm_ctrl_32bit_upb_v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="NVMSRCADDR" edc:desc="" edc:grp="FLASH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NVMSRCADDR" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMSRCADDR" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="NVMSRCADDR" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800A80" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-02819_pfm_ctrl_32bit_upb_v2.Module" edc:_refcount="1" edc:access="n-------nnnnnnnnnnnnrrrrrrrrrrrr" edc:cname="NVMPWP" edc:desc="" edc:impl="0x80ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1-------000000000000000000000000" edc:name="NVMPWP" edc:nzwidth="32" edc:por="1-------000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PWP" edc:desc="" edc:mask="0xffffff" edc:name="PWP" edc:nzwidth="24"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="PWPULOCK" edc:desc="" edc:mask="0x1" edc:name="PWPULOCK" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800A90" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-02819_pfm_ctrl_32bit_upb_v2.Module" edc:_refcount="1" edc:access="----------------n--nnnnnnn-nnnnn" edc:cname="NVMBWP" edc:desc="" edc:impl="0x9fdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1--1111111-11111" edc:name="NVMBWP" edc:nzwidth="32" edc:por="----------------1--1111111-11111" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="UBWP0" edc:desc="" edc:mask="0x1" edc:name="UBWP0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="UBWP1" edc:desc="" edc:mask="0x1" edc:name="UBWP1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="UBWP2" edc:desc="" edc:mask="0x1" edc:name="UBWP2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="UBWP3" edc:desc="" edc:mask="0x1" edc:name="UBWP3" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="UBWP4" edc:desc="" edc:mask="0x1" edc:name="UBWP4" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="DBGWP" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="DBGWP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="UBWPULOCK" edc:desc="" edc:mask="0x1" edc:name="UBWPULOCK" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LBWP0" edc:desc="" edc:mask="0x1" edc:name="LBWP0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LBWP1" edc:desc="" edc:mask="0x1" edc:name="LBWP1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LBWP2" edc:desc="" edc:mask="0x1" edc:name="LBWP2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LBWP3" edc:desc="" edc:mask="0x1" edc:name="LBWP3" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LBWP4" edc:desc="" edc:mask="0x1" edc:name="LBWP4" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="LBWPULOCK" edc:desc="" edc:mask="0x1" edc:name="LBWPULOCK" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800AA0" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-02819_pfm_ctrl_32bit_upb_v2.Module" edc:_refcount="1" edc:access="nnnn-------nnnnnn-nn--nnnn------" edc:cname="NVMCON2" edc:desc="" edc:impl="0xf01fb3c0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuu-------uuuuuu-uu--uu00------" edc:name="NVMCON2" edc:nzwidth="32" edc:por="xxxx-------xxxxxx-xx--xx00------" edc:portals="CLR SET INV" ltx:memberofperipheral="NVM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="SWAPLOCK" edc:mask="0x3" edc:name="SWAPLOCK" edc:nzwidth="0x2"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="DS.1">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="ERETRY" edc:desc="" edc:mask="0x3" edc:name="ERETRY" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="VREAD1" edc:mask="0x1" edc:name="VREAD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CREAD1" edc:mask="0x1" edc:name="CREAD1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="LPRD" edc:mask="0x1" edc:name="LPRD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LPRDWS" edc:mask="0x1f" edc:name="LPRDWS" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="ERSCNT" edc:mask="0xf" edc:name="ERSCNT" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
